wikimedia/smash-pig/Tests/SoapInjector/empty.xml

<?xml version="1.0" ?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<ns1:sendNotification xmlns:ns1="http://notification.services.adyen.com">
			<ns1:notification>
				<live xmlns="http://notification.services.adyen.com">false</live>
				<notificationItems xmlns="http://notification.services.adyen.com">
					<NotificationRequestItem>
						<additionalData xsi:nil="true"/>
						<amount xsi:nil="true"/>
						<eventCode xsi:nil="true"/>
						<eventDate>2012-12-13T02:34:58.576+01:00</eventDate>
						<merchantAccountCode>gCe2auGN</merchantAccountCode>
						<merchantReference>hpuiUuVY</merchantReference>
						<operations xsi:nil="true"/>
						<originalReference xsi:nil="true"/>
						<paymentMethod>vewIj9k</paymentMethod>
						<pspReference xsi:nil="true"/>
						<reason>Dgc=Wqnl8rlkBssI=LnOBi7cF6lpyUEPz3a9P:zxxFN_MOwqAs</reason>
						<success>false</success>
					</NotificationRequestItem>
				</notificationItems>
			</ns1:notification>
		</ns1:sendNotification>
	</soap:Body>
</soap:Envelope>
